import hashlib

مخرج = print
مدخل = input

مخرج("--- أداة ShadowScan-HashBreaker لكسر هاش MD5 ---")

# 1. إدخال الهاش المراد كسر تشفيره
الهاش_المستهدف = مدخل("أدخل الهاش المشفر (MD5): ").strip().lower()

# 2. قائمة مصغرة مدمجة لتجربة الاختراق (Wordlist)
# يمكنك تعديل هذه القائمة وإضافة أي كلمات تريدها
قائمة_التخمين = ["123456", "password", "kali123", "admin", "badero2026", "shadow123"]

مخرج("\n[+] جاري بدء الهجوم والمطابقة البرمجية... انتظر...\n")

نجاح = False

for كلمة in قائمة_التخمين:
    # تحويل الكلمة العادية إلى تشفير MD5
    الهاش_المولد = hashlib.md5(كلمة.encode()).hexdigest()
    
    # مقارنة الهاش المولد بالهاش المستهدف
    if الهاش_المولد == الهاش_المستهدف:
        مخرج(f"🟢 [تم الاختراق بنجاح!] ---> كلمة المرور هي: {كلمة}")
        نجاح = True
        break

if not نجاح:
    مخرج("❌ للاسف، لم يتم العثور على كلمة المرور داخل قائمة التخمين الحالية.")

مخرج("\n--- انتهت عملية فحص التشفير بنجاح ---")

